cask_args appdir: '/Applications'

# Taps
tap "azure/kubelogin"
tap "cue-lang/tap"
tap "derailed/k9s"
tap "go-task/tap"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"

# CLI-tools
brew "azure/kubelogin/kubelogin"

# Misc
brew "bat"
brew "jq"
brew "yq"
brew "fd"
brew "watch"
brew "jesseduffield/lazygit/lazygit"
brew "remotemobprogramming/brew/mob"

# Editor
brew "neovim"
brew "nmap"
brew "tmux"
brew "ripgrep"
brew "fzf"
brew "starship"

# Kubernetes
brew "tilt"
brew "kubeseal"
brew "kubecolor"
brew "k9s"

# Languages
brew "node"
brew "cue-lang/tap/cue"
brew "golang"

# Applications
cask "iterm2"
cask "1password"
cask "amethyst"
cask "docker"
cask "arc"
cask "slack"
cask "spotify"
cask "font-jetbrains-mono-nerd-font"
cask "microsoft-outlook"
